const cityDictionary = {
  小樽市: '北海道',
  札幌市: '北海道',
  旭川市: '北海道',

  仙台市: '宮城県',
  郡山市: '福島県',

  高崎市: '群馬県',
  前橋市: '群馬県',
  宇都宮市: '栃木県',
  川口市: '埼玉県',
  さいたま市: '埼玉県',
  越谷市: '埼玉県',
  川越市: '埼玉県',
  千葉市: '千葉県',
  船橋市: '千葉県',
  柏市: '千葉県',
  相模原市: '神奈川県',
  横浜市: '神奈川県',
  横須賀市: '神奈川県',
  川崎市: '神奈川県',
  藤沢市: '神奈川県',
  茅ヶ崎市: '神奈川県',

  名古屋市: '愛知県',
  岡崎市: '愛知県',
  豊橋市: '愛知県',
  岐阜市: '岐阜県',
  四日市市: '三重県',
  静岡市: '静岡県',
  浜松市: '静岡県',

  長野市: '長野県',
  新潟市: '新潟県',
  富山市: '富山県',

  大阪市: '大阪府',
  堺市: '大阪府',
  京都市: '京都府',
  西宮市: '兵庫県',
  神戸市: '兵庫県',
  姫路市: '兵庫県',
  尼崎市: '兵庫県',
  明石市: '兵庫県',

  広島市: '広島県',
  岡山市: '岡山県',
  下関市: '山口県',

  高知市: '高知県',

  福岡市: '福岡県',
  北九州市: '福岡県',
  久留米市: '福岡県',
  熊本市: '熊本県',
  大分市: '大分県',
  宮崎市: '宮崎県',
}

module.exports = cityDictionary
